(ns brahmanda.math)

;; ==========================================
;; Константи
;; ==========================================

(def π Math/PI)

(def τ (* 2.0 π))

;; ==========================================
;; Кути
;; ==========================================

(defn deg->rad
  "Градуси -> радіани"
  [deg]
  (* deg (/ π 180.0)))

(defn rad->deg
  "Радіани -> градуси"
  [rad]
  (* rad (/ 180.0 π)))

;; ==========================================
;; Вектори
;; ==========================================

(defn vec3
  [x y z]
  {:x x
   :y y
   :z z})

(defn add
  [a b]
  (vec3
    (+ (:x a) (:x b))
    (+ (:y a) (:y b))
    (+ (:z a) (:z b))))

(defn sub
  [a b]
  (vec3
    (- (:x a) (:x b))
    (- (:y a) (:y b))
    (- (:z a) (:z b))))

(defn scale
  [k v]
  (vec3
    (* k (:x v))
    (* k (:y v))
    (* k (:z v))))

(defn dot
  [a b]
  (+ (* (:x a) (:x b))
     (* (:y a) (:y b))
     (* (:z a) (:z b))))

(defn cross
  [a b]
  (vec3
    (- (* (:y a) (:z b))
       (* (:z a) (:y b)))

    (- (* (:z a) (:x b))
       (* (:x a) (:z b)))

    (- (* (:x a) (:y b))
       (* (:y a) (:x b)))))

(defn length
  [v]
  (Math/sqrt (dot v v)))

(defn normalize
  [v]
  (let [l (length v)]
    (scale (/ 1.0 l) v)))
